app/Controllers/DepartamentosController.php

SELECT *
FROM `departamentos`
---
    public function cargarDepartamentos(){
        $departamento = new Departamentos();

        $resultado['resultado'] = $departamento->findAll();